Revit 2027 API
LocationCurve Methods
The LocationCurve type exposes the following members.
Methods
Name | Description
Dispose | Causes the object to release immediately any resources it may be utilizing.
(Inherited from APIObject)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
Move | Move the element within the project by a specified vector.
(Inherited from Location)
Rotate | Rotate the element within the project by a specified angle around a given axis.
(Inherited from Location)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
LocationCurve Class
Autodesk.Revit.DB Namespace